/**
 * Created by ELEMIAN on 29.09.2021.
 */
var mongooseDB = require('mongoose');
const getWorks = require('../modules/getWork');
const db  = require('../config/db');

mongooseDB.Promise = global.Promise;
mongooseDB.connect(db.url, db.options, function (err) {
    if (err) {console.log(err);}


    let codes = [
        'ОС.КЭ.1',
        'ОС.КЭ.1.1',
        'ОС.КЭ.1.1.1',
        'ОС.КЭ.1.1.2',
        'ОС.КЭ.1.1.3',
        'ОС.КЭ.1.2',
        'ОС.КЭ.1.2.1',
        'ОС.КЭ.1.3',
        'ОС.КЭ.2',
        'ОС.КЭ.2.1',
        'ОС.КЭ.2.2',
        'ОС.КЭ.2.3',
        'ОС.КЭ.3',
        'ОС.КЭ.3.1',
        'ОС.КЭ.3.2',
        'ОС.КЭ.3.3',
        'ОС.КЭ.3.4',
        'ОС.КЭ.3.5',
        'ОС.КЭ.4',
        'ОС.КЭ.4.1',
        'ОС.КЭ.4.2',
        'ОС.КЭ.4.3',
        'ОС.КЭ.4.4',
        'ОС.КЭ.4.5',
        'ОС.КЭ.5',
        'ОС.КЭ.5.1',
        'ОС.КЭ.5.2',
        'ОС.КЭ.5.3',
        'ОС.КЭ.5.4',
        'ОС.КЭ.5.5',
        'ОС.КЭ.5.6',
        'ОС.КЭ.5.7',
        'ОС.КЭ.5.8',
        'ОС.КЭ.5.9',
        'ОС.КЭ.5.10',
        'ОС.КЭ.5.11',
        'ОС.КЭ.5.12',
        'ОС.КЭ.6',
        'ОС.СП.1',
        'ОС.СП.1.1',
        'ОС.СП.1.2',
        'ОС.СП.1.4',
        'ОС.СП.1.5',
        'ОС.СП.1.6',
        'ОС.ЗП.1',
        'ОС.ЗП.1.1',
        'ОС.ЗП.1.2',
        'ОС.ЗП.2',
        'ОС.ЗП.2.1',
        'ОС.ЗП.2.2',
        'ОС.ЗП.2.3',
        'ОС.ЗП.2.4',
        'ОС.ЗП.2.5',
        'ОС.ЗП.2.6',
        'ОС.ЗП.2.7',
        'ОС.ЗП.2.8',
        'ОС.ВЦ.1',
        'ОС.ВЦ.1.1',
        'ОС.ВЦ.1.2',
        'ОС.ВЦ.1.3',
        'ОС.ВЦ.2',
        'ОС.ВЦ.2.1',
        'ОС.ВЦ.2.2',
        'ОС.ВЦ.3',
        'ОС.ВЦ.3.1',
        'ОС.ВЦ.3.1.1',
        'ОС.ВЦ.3.1.2',
        'ОС.ВЦ.3.2',
        'ОС.ВЦ.3.2.1',
        'ОС.ВЦ.3.2.2',
        'ОС.ВЦ.3.3',
        'ОС.ВЦ.3.4',
        'ОС.ВЦ.3.5',
        'ОС.ОТ.1',
        'ОС.ОТ.1.1',
        'ОС.ОТ.1.2',
        'ОС.ОТ.2',
        'ОС.ОТ.2.1',
        'ОС.ОТ.2.2',
        'ОС.ОТ.2.3',
        'ОС.ОТ.3',
        'ОС.ОТ.3.1',
        'ОС.ОТ.3.2',
        'ОС.ОТ.4',
        'ОС.ОТ.4.1',
        'ОС.ОТ.4.2',
        'ОС.ВО.1',
        'ОС.ВО.1.1',
        'ОС.ВО.1.2',
        'ОС.ВО.1.3',
        'ОС.ВО.1.4',
        'ОС.ВО.1.4.1',
        'ОС.ВО.1.4.2',
        'ОС.ВО.1.4.3',
        'ОС.ВО.1.4.4',
        'ОС.ВО.1.4.5',
        'ОС.ВО.1.4.6',
        'ОС.ВО.2',
        'ОС.ВО.2.1',
        'ОС.ВО.2.1.1',
        'ОС.ВО.2.1.2',
        'ОС.ВО.2.1.3',
        'ОС.ВО.2.2',
        'ОС.ВО.2.2.1',
        'ОС.ВО.2.2.2',
        'ОС.ВО.2.2.3',
        'ОС.ВО.2.3',
        'ОС.ВО.2.3.1',
        'ОС.ВО.2.3.2',
        'ОС.ВО.2.4',
        'ОС.ВО.2.4.1',
        'ОС.ВО.2.4.2',
        'ОС.ВО.2.4.3',
        'ОС.ВО.2.5',
        'ОС.ВО.2.5.1',
        'ОС.ВО.2.5.2',
        'ОС.ВО.2.6',
        'ОС.ВО.2.6.1',
        'ОС.ВО.2.6.2',
        'ОС.ВО.2.7',
        'ОС.ВО.2.8',
        'ОС.ВО.2.8.2',
        'ОС.ВО.2.8.3',
        'ОС.ВО.2.9',
        'ОС.ВО.2.9.1',
        'ОС.ВО.2.9.2',
        'ОС.ВО.2.9.3',
        'ОС.ВО.2.9.4',
        'ОС.ВО.2.9.5',
        'ОС.ВО.2.9.6',
        'ОС.ВО.2.9.7',
        'ОС.ВО.2.9.8',
        'ОС.ВО.2.9.9',
        'ОС.ВО.2.9.10',
        'ОС.ВО.2.9.11',
        'ОС.ВО.2.9.12',
        'ОС.ВО.2.9.13',
        'ОС.ВО.2.9.14'
    ]


    codes.forEach(function (code, i) {
        let delayTime = i*800;
        setTimeout(function () {
            getWorks(code,function (rest) {
                console.log(code);
                if(rest.data&&rest.data.length>0){
                    console.log(rest.data);
                    TechUpdate(code,rest.data,function (cb) {
                        console.log(cb)
                    })
                }

            })
        },delayTime)
    })
});




function TechUpdate(code,data,callback) {
    var TECH = require('../models/REST');
    data.forEach(function (d) {
        console.log(code);
        var tech = JSON.stringify(d);
        var NTECH = {
            code: code,
            thickness: d.thickness,
            guid: d.guid,
            tech: tech
        };

        TECH.updateOne(
            {guid: d.guid},NTECH
            ,{upsert:true}).exec(function (err,doc) {
            if (!err){console.log("Запись работы прошла успешно");}
            if (err) {throw err;}
            callback(doc)
            });
    });
}


